Q3. Create a Pandas DataFrame that contains the following data:
Name    Age     Gender
Alice   25      Female
Bob     30      Male
Claire  27      Female
Then, print the DataFrame.

In [127]:
import pandas as p

In [128]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [129]:
df1=p.read_csv('file.csv')

In [130]:
df1

     NAME  AGE  GENDER
0   ALICE   25  FEMALE
1     BOB   30    MALE
2  CLAIRE   27  FEMALE

In [131]:
type(df1)

pandas.core.frame.DataFrame

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [132]:
df=p.read_csv('file2.csv')

In [133]:
df

   num1  num2
0     4     8
1    15    16
2    23    42

In [134]:
df.columns

Index(['num1', 'num2'], dtype='object')

In [135]:
series=df['num1']

In [136]:
series

0     4
1    15
2    23
Name: num1, dtype: int64

In [137]:
type(series)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [138]:
import pandas as p
x=p.Series([1,2,3,4,5,6,7,8,9,10])

In [139]:
x

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns
A pandas Series is a one-dimensional array. It holds any data type supported in Python and uses labels to locate each data value for retrieval. These labels form the index, and they can be strings or integers. A Series is the main data structure in the pandas framework for storing one-dimensional data.

In [143]:
p.DataFrame([1,2,3,4,5,6])

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [144]:
p.Series([1,2,3,4,5,6])

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [157]:
df=p.DataFrame([1,2,3,4,5],
           [6,7,8,9,10])

In [158]:
df

    0
6   1
7   2
8   3
9   4
10  5

In [159]:
df.add(1)

    0
6   2
7   3
8   4
9   5
10  6

In [160]:
df

    0
6   1
7   2
8   3
9   4
10  5

In [161]:
df.head(2)

   0
6  1
7  2

In [162]:
df.tail(3)

    0
8   3
9   4
10  5

In [163]:
df.dtypes

0    int64
dtype: object

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

A Series is a one dimensional array like structure with homogeneous data. The values of the series are mutable means we can change any value in series, but the size of the series is immutable so we can not change the size of the series.


DataFrame is a two-dimensional array with heterogeneous data. A DataFrame size is mutable and data is also mutable so we can change the data and size of DataFrame at any time


The panel is a three-dimensional data structure with heterogeneous data. It is very hard to represent the Panel in a graphical representation. But a Panel can be illustrated as a container of a DataFrame. In Panel Data and size are mutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [5]:
import pandas as p
courses=p.Series(["data_science","web_development","java_script"])
fees=p.Series([20000,20000,20000])
df=p.concat([courses,fees],axis=1)
df

                 0      1
0     data_science  20000
1  web_development  20000
2      java_script  20000